#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/randovania/server/runs/run-gNudGkrkufA8NYMG

Waiting for the plan to start...

Terraform v1.3.6
on linux_amd64
Initializing plugins and modules...
digitalocean_droplet.main: Refreshing state... [id=207924731]
digitalocean_floating_ip.gdq_server_ip: Refreshing state... [id=146.190.14.215]
digitalocean_floating_ip.randovania_metroidprime_run: Refreshing state... [id=138.68.125.26]
digitalocean_firewall.http_server: Refreshing state... [id=2fcd8b6b-b72c-4a57-9c3f-4146e270e9ee]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # digitalocean_droplet.gdq_server will be created
  + resource "digitalocean_droplet" "gdq_server" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "ubuntu-20-04-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = true
      + name                 = "GDQ Server"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "sfo3"
      + resize_disk          = true
      + size                 = "s-1vcpu-1gb"
      + status               = (known after apply)
      + tags                 = [
          + "critical",
        ]
      + urn                  = (known after apply)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # digitalocean_floating_ip.gdq_server_ip is tainted, so must be replaced
-/+ resource "digitalocean_floating_ip" "gdq_server_ip" {
      ~ droplet_id = 207924731 -> (known after apply)
      ~ id         = "146.190.14.215" -> (known after apply)
      ~ ip_address = "146.190.14.215" -> (known after apply)
      ~ urn        = "do:floatingip:146.190.14.215" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 5 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @henriquegemignani, Action: `pull_request`*